Перем Шаг;
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриОткрытии()
	Шаг = ЭлементыФормы.Панель1.Ширина / 10;
КонецПроцедуры

Процедура XНажатие(Элемент)
	ПодключитьОбработчикОжидания("ПлавноУехатьВправо", 0.1, Истина);
КонецПроцедуры

Процедура ПлавноУехатьВправо()
	Если ЭлементыФормы.Панель1.Лево < ЭлементыФормы.Панель1.Ширина Тогда
		ЭлементыФормы.Панель1.Лево = ЭлементыФормы.Панель1.Лево + Шаг;
		ПодключитьОбработчикОжидания("ПлавноУехатьВправо", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры


